vanvught/GD32F407RE-DMX512-RDM/lib-gd32/device/enet/ptp/gd32_ptp.cpp
/**
 * @file gd32_ptp.cpp
 *
 */
/* Copyright (C) 2024-2026 by Arjan van Vught mailto:info@gd32-dmx.org
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <cstdint>
#include <cstring>
#include <time.h>
#include <sys/time.h>

#include "gd32.h" // IWYU pragma: keep
#include "gd32_ptp.h"
#include "firmware/debug/debug_debug.h"

void Error(const char*);

#if defined(GD32H7XX)
#define enet_interrupt_disable(x) enet_interrupt_disable(ENETx, x)
#define enet_ptp_feature_enable(x) enet_ptp_feature_enable(ENETx, x)
#define enet_ptp_subsecond_increment_config(x) enet_ptp_subsecond_increment_config(ENETx, x)
#define enet_ptp_timestamp_function_config(x) enet_ptp_timestamp_function_config(ENETx, x)
#define enet_ptp_timestamp_addend_config(x) enet_ptp_timestamp_addend_config(ENETx, x)
#define enet_ptp_timestamp_update_config(x, y, z) enet_ptp_timestamp_update_config(ENETx, x, y, z)
#define enet_ptp_system_time_get(x) enet_ptp_system_time_get(ENETx, x)
static FlagStatus EnetPtpflagstatusGet(uint32_t flag) {
    FlagStatus bitstatus = RESET;

    if (0 != (ENET_PTP_TSCTL(ENETx) & flag)) {
        bitstatus = SET;
    }

    return bitstatus;
}
#else
static FlagStatus EnetPtpflagstatusGet(uint32_t flag) {
    FlagStatus bitstatus = RESET;

    if (0 != (ENET_PTP_TSCTL & flag)) {
        bitstatus = SET;
    }

    return bitstatus;
}
#endif // GD32H7XX

static void PtpStart(uint32_t init_sec, uint32_t init_subsec, [[maybe_unused]] uint32_t carry_cfg, uint32_t accuracy_cfg) {
    DEBUG_ENTRY();

    enet_interrupt_disable(ENET_MAC_INT_TMSTIM);

#if defined(GD32F4XX) || defined(GD32H7XX)
    enet_ptp_feature_enable(ENET_ALL_RX_TIMESTAMP | ENET_RXTX_TIMESTAMP);
#else
    enet_ptp_feature_enable(ENET_RXTX_TIMESTAMP);
#endif // defined(GD32F4XX) || defined(GD32H7XX)
    enet_ptp_subsecond_increment_config(accuracy_cfg);

    enet_ptp_timestamp_addend_config(carry_cfg);

    enet_ptp_timestamp_function_config(ENET_PTP_ADDEND_UPDATE);
    while (EnetPtpflagstatusGet(ENET_PTP_ADDEND_UPDATE) == SET);

    enet_ptp_timestamp_function_config(ENET_PTP_FINEMODE);

    enet_ptp_timestamp_update_config(ENET_PTP_ADD_TO_TIME, init_sec, init_subsec);
    enet_ptp_timestamp_function_config(ENET_PTP_SYSTIME_INIT);
    while (EnetPtpflagstatusGet(ENET_PTP_SYSTIME_INIT) == SET);

    DEBUG_EXIT();
}

void Gd32PtpStart() {
    DEBUG_ENTRY();
    DEBUG_PRINTF("PTP_TICK=%u", gd32::ptp::kPtpTick);
    DEBUG_PRINTF("ADJ_FREQ_BASE_INCREMENT=%u", gd32::ptp::kAdjFreqBaseIncrement);
    DEBUG_PRINTF("ADJ_FREQ_BASE_ADDEND=x%X", static_cast<unsigned>(gd32::ptp::kAdjFreqBaseAddend));

    struct tm tmbuf;
    memset(&tmbuf, 0, sizeof(struct tm));
    tmbuf.tm_mday = _TIME_STAMP_DAY_;         // The day of the month, in the range 1 to 31.
    tmbuf.tm_mon = _TIME_STAMP_MONTH_ - 1;    // The number of months since January, in the range 0 to 11.
    tmbuf.tm_year = _TIME_STAMP_YEAR_ - 1900; // The number of years since 1900.

    PtpStart(static_cast<uint32_t>(mktime(&tmbuf)), 0, gd32::ptp::kAdjFreqBaseAddend, gd32::ptp::kAdjFreqBaseIncrement);

#ifndef NDEBUG
    struct timeval tv;
    gettimeofday(&tv, nullptr);
    auto* tm = localtime(&tv.tv_sec);

    DEBUG_PRINTF("%.2d-%.2d-%.4d %.2d:%.2d:%.2d.%.6d", tm->tm_mday, tm->tm_mon + 1, tm->tm_year + 1900, tm->tm_hour, tm->tm_min, tm->tm_sec, static_cast<int>(tv.tv_usec));
#endif // NDEBUG
    DEBUG_EXIT();
}

void Gd32PtpGetTime(gd32::ptp::ptptime* ptp_time) {
    enet_ptp_systime_struct systime;

    enet_ptp_system_time_get(&systime);

    ptp_time->tv_sec = systime.second;
#if !defined(GD32F4XX)
    ptp_time->tv_nsec = systime.nanosecond;
#else
    ptp_time->tv_nsec = gd32::PtpSubsecond2Nanosecond(systime.subsecond);
#endif // GD32F4XX
}

void Gd32PtpSetTime(const gd32::ptp::ptptime* ptp_time) {
    const auto kSign = ENET_PTP_ADD_TO_TIME;
    const auto kSecond = ptp_time->tv_sec;
    const auto kNanoSecond = ptp_time->tv_nsec;
    const auto kSubSecond = gd32::PtpNanosecond2Subsecond(kNanoSecond);

    enet_ptp_timestamp_update_config(kSign, kSecond, kSubSecond);
    enet_ptp_timestamp_function_config(ENET_PTP_SYSTIME_INIT);
    while (EnetPtpflagstatusGet(ENET_PTP_SYSTIME_INIT) == SET);
}

void Gd32PtpUpdateTime(const gd32::ptp::time_t* time) {
    uint32_t sign;
    uint32_t second;
    uint32_t nano_second;

    if (time->tv_sec < 0 || (time->tv_sec == 0 && time->tv_nsec < 0)) {
        sign = ENET_PTP_SUBSTRACT_FROM_TIME;
        second = static_cast<uint32_t>(-time->tv_sec);
        nano_second = static_cast<uint32_t>(-time->tv_nsec);
    } else {
        sign = ENET_PTP_ADD_TO_TIME;
        second = static_cast<uint32_t>(time->tv_sec);
        nano_second = static_cast<uint32_t>(time->tv_nsec);
    }

    const auto kSubSecond = gd32::PtpNanosecond2Subsecond(nano_second);
#if defined(GD32H7XX)
    const auto kAddend = ENET_PTP_TSADDEND(ENETx);
#else
    const auto kAddend = ENET_PTP_TSADDEND;
#endif // GD32H7XX

    enet_ptp_timestamp_update_config(sign, second, kSubSecond);
    enet_ptp_timestamp_function_config(ENET_PTP_SYSTIME_UPDATE);
    while (EnetPtpflagstatusGet(ENET_PTP_SYSTIME_UPDATE) == SET);

    enet_ptp_timestamp_addend_config(kAddend);
    enet_ptp_timestamp_function_config(ENET_PTP_ADDEND_UPDATE);
}

bool Gd32AdjFrequency(uint32_t adjust_ppb) {
    const auto kAdjust = static_cast<uint64_t>(gd32::ptp::kAdjFreqBaseAddend) * adjust_ppb;
    const auto kAddend = gd32::ptp::kAdjFreqBaseAddend + static_cast<uint32_t>(kAdjust / 1000000000ULL);

    enet_ptp_timestamp_addend_config(kAddend);

    const auto kReval = enet_ptp_timestamp_function_config(ENET_PTP_ADDEND_UPDATE);

    if (kReval == ERROR) {
        Error("enet_ptp_timestamp_addend_config\n");
    }

    return kReval != ERROR;
}
